---
kind: type
id: T:Autodesk.Revit.DB.BuildingType
source: html/4c72befb-2ad7-b4e8-3160-0845d4cf47b0.htm
---
# Autodesk.Revit.DB.BuildingType

This enumeration is used for specifying the most predominant building use type.

## Syntax (C#)
```csharp
public enum BuildingType
```

## Remarks
This enumerated list corresponds to the buildingType attribute in the gbXML (Green Building XML) schema
 and is primarily used for energy analysis.